def function(int5):
    for i in range(0,5):
        if int5[i] >= 0:
            int5[i] = int5[i] + 1
    
    a = 1/int5[0];
    b = 1/int5[1];
    c = 1/int5[2];
    d = 1/int5[3];
    e = 1/int5[4];

    list_5 = [a,b,c,d,e];
    list_5.sort();
    
    return list_5[1]+list_5[2]+list_5[3];

string0 = "的一是了不在有个人这上中大为来我到出要以时和地们得可下对生也子就过能他会多发说而于自之用年行家方后作成开面事好小心前所道法如进着同经分定都然与本还其当起动已两点从问里主实天高去现长此三将无国全文理明日些看只公等十意正外想间把情者没重相那向知因样学应又手但信关使种见力名二处门并口么先位头回话很再由身入内第平被给次别几月真立新通少机打水果最部何安接报声才体今合性西你放表目加常做己老四件解路更走比总金管光工结提任东原便美及教难世至气神山数利书代直色场变记张必受交非服化求风度太万各算边王什快许连五活思该步海指物则女或完马强言条特命感清带认保望转传儿制干计民白住字它义车像反象题却流且即深近形取往系量论告息让决未花收满每华业南觉电空眼听远师元请容她军士百办语期北林识半夫客战院城候单音台死视领失司亲始极双令改功程爱德复切随李员离轻观青足落叫根怎持精送众影八首包准兴红达早尽故房引火站似找备调断设格消拉照布友整术石展紧据终周式举飞片虽易运笑云建谈界务写钱商乐推注越千微若约英集示呢待坐议乎留称品志黑存六造低江念产刻节尔吃势依图共曾响底装具喜严九况跟罗须显热病证刚治绝群市阳确究久除闻答段官政类黄武七支费父统"


string1 = "的一是在了不和有大这主中人上为们个地用工时要动国产以我到他会作来分生对于学下级就年阶义发成部民可出能方进同行面说种过命度革而多子后自社加小机也经力线本电高量长党得实家定深法表着水理化争现所二起政三好十战无农使性前等反体合斗路图把结第期里正新开论之物从当两些还天资事队批如应形想制心样干都向变关点育重其思与间内去因件日利相由压员气业代全组数果导平各基或月毛然问比展那它最及外没看治提五解系林者米群头意只明四道马认次文通但条较克又公孔领流入接军席位情运器并习原油立放题质指建区验活众很教决特此常石强极土少己根共直团统式转别造切九你取西持总料连任志观调么七山程百报更见必真保热委手改管处将已修支识病象几先老光专什六型具示复安带每东增则完风回南广劳轮科北打积车计给节做务被整联步类集号列温装即毫轴知研单色坚据速防史拉设世达尔场织历花受求传口断况采精金界品判参层止边清至万确究书术厂状须离再目海交且儿青才证低越际八试规斯近注办布门铁需走议县虫固除般引齿千胜细影白济格效推兵空配刀叶率述今选养话查差德半敌始片施响收华觉备红名续均药标记难存士身测紧液置派准斤角降维板许破技端消底床田势感往神便圆村构照容非搞亚磨族火"


string2 ="的一国在人了有中是年和大业不为发会工经上地市要个产这出行作生家以成到日民来我部对进多全建他公开们场展时理新方主企资实学报制政济用同于法高长现本月定化加动合品重关机分力自外者区能设后就等体下万元社过前面农也得与说之员而务利电文事可种总改三各好金第司其从平代当天水省提商十管内小技位目起海所立已通入量子问度北保心还科委都术使明着次将增基名向门应里美由规今题记点计去强两些表系办教正条最达特革收二期并程厂如道际及西口京华任调性导组东路活广意比投决交统党南安此领结营项情解议义山先车然价放世间因共院步物界集把持无但城相书村求治取原处府研质信四运县军件育局干队团又造形级标联专少费效据手施权江近深更认果格几看没职服台式益想数单样只被亿老受优常销志战流很接乡头给至难观指创证织论别五协变风批见究支那查张精每林转划准做需传争税构具百或才积势举必型易视快李参回引镇首推思完消值该走装众责备州供包副极整确知贸己环话反身选亚么带采王策真女谈严斯况色打德告仅它气料神率识劳境源青护列兴许户马港则节款拉直案股光较河花根布线土克再群医清速律她族历非感占续师何影功负验望财类货约艺售连纪按讯史示象养获石食抓富模始住赛客越闻央席坚"


string3 ="的一是了人不国有他这我和个上为年在中大地来要生经也得着能而全市者分小政道所心社等体机已电十样点正内品万各目企立会以作就工自方进主用之长公文定力与关外场其利两三把但名特此斯又比元由入到发家日多子后部里产事你前好都月展加然化没将美资代表济西平间提记水通手们说对行学民下开现理动那面天她还当建报么制如问明想区最使无位军并设世题出时业成于过可新同法本实去种高重起从合看些意第员总情因次只向海华度性务北门东保安解先己基它克交决计路处四增程运感规接求府干声神集传王投林布光专育告争爱眼便英士很应物系期知管尔口战统论果委领山走京治导党持形收步反亚再流价风许必举每命边住白巴李赛证百金头见队义强际达司给信常什德议商南放联件真做据才取难张革色非权完太何快精选志清识历施转费二活科农今任改及界拉儿女几组受车技共办马省指院数思变城造台局团象望服史该带标村视确支亲让书相老教被量话回术结身认原别少更条气或调打至格近广式研深五观项直质究首级示江参谈单营影罗约根具众效港言包装周益族希优八未乐积群较乡息香源称响图伊算游助版劳黄飞负读著孩模访银奥苏极却像始推写消势备师失且阿越亿护仅热型存容双照呢钱半怎席注请富验防演千洲速击央普兵"


string4 ="的一了是不我这在人有他来个道你大到就上着们那也说么下出地然中看时要没天过可自子能还之以去好后为都会心得里对身手起小想只而和头她无力面己如什现多样已知些声经前神笑事开点方眼发所但气法意情生两家间将很真话成让老被动当用于见回又军把此才几正战明却龙从十三长女光再向实最行高本打风进定魔给问色国同走其种年口边王怎次白全吧儿感果听啊死外体飞分主觉住少比空门因等轻直第脸候相何强张做与重快太应刚位接便量更难二名连水内西马黑兵师入部作吗虽击别放四公完灵并先士处剑算东机火微城变杀叫李带清队斯望竟云原者星山像惊呢海安族金月目加特跟场万林由日任立百使美关命理转思血乎受常离该远数物阵界平冷刻信至突随怪失许五反似找般雷武非通奇绝怕解精暗满双修度红且世半始倒今拉学落攻它传尔音指路越容石表紧冲利哥步合罗够影若伤姐亲功丝弟整息吃势花众帝早哈极青流团根静周即深形近千消结干制皇速帮性楚言备系提教令雪文必谁终站哪化破认级忙往玉底车总仙巨坐男显新斗各克急领切衣杨阳敢收围异达慢件错象服叶办保片喜活朝刀摇准兴条电拿交夜兽管华断尽决苦则八易依语闪露冰足响德记害及兰计元官顿器圣南阿嘴七告球爱敌夫留沉请威每乱况确答陈格视护淡凌脑兄狂宝识"


total = set(string0 + string1 + string2 + string3 + string4 );

total = str(total)

word_int5=dict();
int5=[-1,-1,-1,-1,-1]

for i in total:
    int5[0] = string0.find(i);
    int5[1] = string1.find(i);
    int5[2] = string2.find(i);
    int5[3] = string3.find(i);
    int5[4] = string4.find(i);
    value = function(int5)
    word_int5.update({i:value});

out = sorted(word_int5.items(), key=lambda item:item[1], reverse=True);

b="";
for i in range(0,100):
    b=b+(out[i])[0];

print(b)




